import React from 'react';
import './Profilcation.css';
import { Link } from 'react-router-dom';
const back = './back.svg';

export default () => (
    <div className="profilaction">
        <div className="container">
            <div className="padd-block">
                <Link className="back-to-news" to="/news"><img src={back} alt="back"/></Link>
                <p className="main-text">Не фармацевтичними засоби захисту (далі - НЗЗ) - це заходи направленні на попередження поширення респіраторних захворювань за допомогою не медикаментозних засобів. НЗЗ можуть допомогти людям захистити себе та інших від зараження і поширення респіраторних захворювань. НЗЗ особливо важливі під час спалахів інфекційних захворювань.</p>
                <p className="main-text">Спалахи респіраторних захворювань можуть виникати тоді, коли серед людей з'являється новий штам вірусу, що і відбулося із SARS-CoV-2, який вперше було ідентифіковано у Китаї у січні 2020 року. Оскільки це новий вірус, у населення практично немає імунітету до нього. Це сприяє швидкому поширенню вірусу від людини до людини по всьому світу. Можуть пройти місяці, перш ніж буде розроблена ефективна вакцина.</p>
                <p className="main-text">Що можна зробити особисто: Залишайтеся вдома, якщо ви захворіли (це стосується лише легких форм захворювання, при погіршенні стану обов'язково зверніться до свого сімейного лікаря). Прикривайте рот під час кашлю чи чхання зігнутим ліктем, або краще одноразовою серветкою. Часто мийте руки з милом чи обробляйте антисептичними спиртовмісними засобами, уникайте близького контакту з тими, хто має гарячку або кашель.</p>
                <p className="main-text">Що може зробити кожен, щоб вберегти навколишнє середовище від поширення SARS-CoV-2: очищувати і дезінфікувати поверхні, до яких часто доторкуються, наприклад, дверні ручки.
                Заходи і плани, які ви розробляєте сьогодні, мають важливе значення для запобігання занесенню та поширенню коронавірусної інфекції COVID-19 в вашому закладі.
                </p>
            </div>
        </div>
    </div>
)