import photo from '../../public/Avatar1.png'
import r36 from '../../public/Rectangle36.png'
import bitmap from '../../public/Bitmap.png'

const face1 = './face1.png'
const face2 = './face2.png'
const face3 = './face3.png'
const face4 = './face4.png'
const ach1 = './sunny-1.png'
const ach2 = './sunny-2.png'
const ach3 = './sunny-3.png'
const ach4 = './sunny-4.png'
const director = './001 (1).jpg'
const nau = './Наугольна.jpg'
const net = './Photo_Net_ZhNN.jpg'
const photo1 = './002.jpg'
const photo2 = './003.jpg'
const photo3 = './005.jpg'
const photo4 = './006.jpg'
const photo5 = './007.jpg'
const photo6 = './008.jpg'
const photo7 = './0010.jpg'
const photo8 = './0011.jpg'
const photo9 = './0012.jpg'
const photo10 = './0013.jpg'
const photo11 = './0016.jpg'
const photo12 = './0017.jpg'
const photo13 = '/0018.jpg'
const photo14 = './0019.jpg'
const photo15 = './0020.jpg'
const fur = './Fursov2.jpg'
const gry = './Gryshenko.jpg'
const kos = './Kosturina.jpg'
const kov = './LRM_EXPORT_199738343304520_20190604_211343484.jpeg'
const kor = './LRM_EXPORT_199997970777411_20190604_211803111.jpeg'
const sal = './LRM_EXPORT_200001587526485_20190604_211806728.jpeg'
const pod = './Poddyakonova.jpg'
const gam = './Gamaliy.jpg'
const tes = '2020-06-11 23.15.30.jpg'

const initialState = {
    from: "UA",
    UA: {
        examPage: {
            head: 'Розклад іспитів',
            sub1: '121 "Інженерія програмного забезпечення"',
            text2: '1 курс',
            text3: '2 курс',
            text4: '3 курс',
            text5: '4 курс',
            text2A: 'Перейти',
            text3A: 'Перейти',
            text4A: 'Перейти',
            text5A: 'Перейти',
            sub3: '123 "Комп\'ютерна інженерія"',
            text6: '1 курс',
            text7: '2 курс',
            text8: '3 курс',
            text9: '4 курс',
            text6A: 'Перейти',
            text7A: 'Перейти',
            text8A: 'Перейти',
            text9A: 'Перейти'
        },
        znoPage: {
            head: 'ЗНО 2020 року',
            text: 'ЗНО'
        },
        zaminy: {
            head: 'Заміни у розкладі занять',
            sub1: '121 "Інженерія програмного забезпечення"',
            text2: '1 курс',
            text3: '2 курс',
            text4: '3 курс',
            text5: '4 курс',
            text2A: 'Перейти',
            text3A: 'Перейти',
            text4A: 'Перейти',
            text5A: 'Перейти',
            sub3: '123 "Комп\'ютерна інженерія"',
            text6: '1 курс',
            text7: '2 курс',
            text8: '3 курс',
            text9: '4 курс',
            text6A: 'Перейти',
            text7A: 'Перейти',
            text8A: 'Перейти',
            text9A: 'Перейти'
        },
        daySchedulePage: {
            head: 'Розклад навчальних занять',
            sub1: 'Студентів денної форми навчання на період з 1 лютого до 31 червня 2020 року',
            pdfText: 'Графік навчального процесу',
            sub2: '121 "Інженерія програмного забезпечення"',
            text2: '1 курс',
            text3: '2 курс',
            text4: '3 курс',
            text5: '4 курс',
            text2A: 'Перейти',
            text3A: 'Перейти',
            text4A: 'Перейти',
            text5A: 'Перейти',
            sub3: '123 "Комп\'ютерна інженерія"',
            text6: '1 курс',
            text7: '2 курс',
            text8: '3 курс',
            text9: '4 курс',
            text6A: 'Перейти',
            text7A: 'Перейти',
            text8A: 'Перейти',
            text9A: 'Перейти'
        },
        ratingPage: {
            head: 'Cтипендіальний рейтинг',
            pdfText: 'Положення про стипендіальне забезпечення ХПКК',
            sub1: '121 "Інженерія програмного забезпечення"',
            text1: 'Останне оновлення 20.20.2020',
            text2: '1 курс',
            text3: '2 курс',
            text4: '3 курс',
            text5: '4 курс',
            text2A: 'Перейти',
            text3A: 'Перейти',
            text4A: 'Перейти',
            text5A: 'Перейти',
            sub2: '123 "Комп\'ютерна інженерія"',
            text10: 'Останне оновлення 20.20.2020',
            text6: '1 курс',
            text7: '2 курс',
            text8: '3 курс',
            text9: '4 курс',
            text6A: 'Перейти',
            text7A: 'Перейти',
            text8A: 'Перейти',
            text9A: 'Перейти'
        },
        publicPage: {
            head: 'Доступ до публічної інформації',
            text1: 'Метою Закону України «Про доступ до публічної інформації» є забезпечення прозорості та відкритості суб’єктів владних повноважень і створення механізмів реалізації права кожного на доступ до публічної інформації.',
            text2: 'Відповідно до Закону України «Про доступ до публічної інформації» публічна інформація ‑ це відображена та задокументована будь-якими засобами та на будь-яких носіях інформація, що була отримана або створена в процесі виконання суб’єктами владних повноважень своїх обов’язків, передбачених чинним законодавством, або яка знаходиться у володінні суб’єктів владних повноважень, інших розпорядників публічної інформації, визначених цим Законом.',
            text3: 'Цей Закон не поширюється на відносини щодо отримання інформації суб’єктами владних повноважень при здійсненні ними своїх функцій, а також на відносини у сфері звернень громадян, які регулюються спеціальним законом.',
            text4: 'Публічна інформація, створена в процесі діяльності Міністерства освіти і науки України, надається у відповідь на запит на отримання публічної інформації.',
            text5: 'Документ 1'
        },
        consultationPage: {
            head: 'Консультації до вступу',
            text1: 'Українська мова',
            text2: 'Математика',
            text3: 'Зручний графік',
            text4: 'Поруч із метро',
            text5: 'Привабливі умови',
            text6: 'Якісна освіта',
            text7: 'Підготовчі курси для вступу в Коледж – це сприятливий старт для комфортного навчання в подальшому. Оскільки ми не повинні забувати про той факт, що майбутні студенти Коледжу насамперед є дітьми підліткового віку і дуже важливо не упустити період адаптації в новому навчальному середовищі, можливості впровадження варіативних навчальних методик в освітній процес, призвичаїтися до методики викладання викладачів вищого навчального закладу, що використовується на практиці в Коледжі до моменту вступу.',
            text8: 'Департамент довузівської підготовки пропонує Вам навчання на підготовчих курсах два рази на тиждень. Кількість слухачів у групах – до 30-ти осіб. Заняття проводять висококваліфіковані викладачі ХПКК. Вони допомагають абітурієнтам систематизувати шкільну програму та засвоїти новий навчальний матеріал, а також успішно підготуватися до в',
            text9: 'Розклад консультацій',
            text10: 'П-1',
            text10A: 'Розгорнути',
            text10: 'П-2',
            text10A: 'Розгорнути',
            text10: 'П-3',
            text10A: 'Розгорнути',
            text10: 'П-4',
            text10A: 'Розгорнути'
        },
        contractPage: {
            head: 'Реквізити для сплати контракту',
            text1Bold: 'Код отримувача',
            text1: '123456789',
            text2Bold: 'Р/р отримувача',
            text2: '123456789',
            text3Bold: 'Банк отримувача',
            text3: 'Bank of Ukraine'
        },
        specialtyPage: {
            head: 'Спеціальності',
            sub1: '121 «Інженерія програмного забезпечення',
            text1: 'Програма спеціальності 121 «Інженерія програмного забезпечення» орієнтована на підготовку кваліфікованих фахівців в галузі інженерії програмного забезпечення, котра спрямована на розробку програмних систем, які працюють надійно та ефективно, вартість розробки та супроводу яких є доступною, і які задовольняють вимогам, висунутим до них замовниками. Сьогодні фахівці з інженерії програмного забезпечення є найбільш затребуваними на ринку праці серед інших фахівців з інформаційних технологій, вони приймають участь у розробці вітчизняних і міжнародних програмних проектів, і мають достойну оплату своєї праці. Попит на фахівців з інженерії програмного забезпечення у майбутньому буде тільки зростати.',
            text2: 'Основні спеціалізації:',
            text3: 'Прикладне програмування (з поглибленим вивченням спеціалізованих дисциплін)',
            text4: 'Web-програмування: розробка сайтів',
            text5: 'Блокчейн та прикладне програмне забезпечення',
            sub2: "123 \"Комп'ютерна інженерія\"",
            text6: 'Технологічна сфера: знання комп’ютерів, їх збирання, тестування та ремонту, програмування, інтернет-сервісів і мобільних технологій.',
            text7: 'Математична сфера: проектування програмних додатків і розумних апаратних пристроїв, кібер-безпека, антивіруси, проектування цифрових систем на кристалах і комп’ютерних мереж.',
            text8: 'Сфера програмування для ринку праці: C ++, Java, Python, .NET, C #, VHDL, Verilog, System C.',
            text9: 'Вміння і компетентності, якими буде володіти випускник за спеціальністю Комп’ютерна інженерія:',
            text10: '1. Розробка і обслуговування систем і мереж під управлінням Windows, Unix, Linux;',
            text11: '2. Створення бездротових засобів комунікації, розробка програмних продуктів за допомогою мовних засобів високого і низького рівнів C ++, С #, Java, Python, Assembler і мікромініатюрних цифрових систем на кристалах;',
            text12: '3. Розробка користувальницьких і системних інтерфейсів, апаратних і програмних компіляторів, інтелектуальних систем програмування та проектування баз знань;',
            text13: '4. Аналітика великих даних;',
            text14: '5. Проектування хмарних сервісів і мобільних додатків, розумних пристроїв, інтегрованих з Інтернет мережами.'
        },
        vstupPage: {
            head: 'Вступ на програми молодшого спеціаліста',
            text1: 'Харківський патентно- комп’ютерний коледж запрошує Вас продовжити навчання в нашому навчальному закладі. Ми пропонуємо Вам отримати професії, які користуються великим попитом в розробці програмного забезпечення та комп’ютерних – провідних галузях економіки нашої держави.',
            text2: 'За додатковою інформацією, будь ласка, звертайтесь до розділу ',
            text2A: '«Контакти»',
            text3: 'або завітайте на ',
            text3A: '«День відкритих дверей»',
            text4: 'Всім, хто прийде до нас на навчання, ми гарантуємо якісну загальноосвітню, загальнотехнічну та професійну підготовку, що дасть змогу кожному стати кваліфікованим, конкурентоспроможним робітником та майстром своєї справи.',
            icon1: {
                frontText: 'Форма навчання',
                backText: 'Денна форма навчання, пари проходять у коледжі'
            },
            icon2: {
                frontText: 'Спеціальності',
                backText: '“121”- Інженерія програмного забезпечення “123” - Комп’ютерна інженерія'
            },
            icon3: {
                frontText: 'Тривалість навчання',
                backText: 'Навчання триває 4 академічні роки'
            },
            icon4: {
                frontText: 'Правила прийому',
                backText1: 'З правилами прийому ви може ознайомитися на сторінці ',
                backText1A: '"Вступ на Програму молодшого спеціаліста"'
            },
            text5: 'Навчання в коледжі можливе за спеціальностями',
            text6: '121 «Інженерія програмного забезпечення» ',
            text6A: 'Вартість навчання',
            text6: "123 «Комп'ютерна інженерія» ",
            text6A: 'Вартість навчання',
            sub: 'Графік проведення вступної компанії',
            text7: 'Денна форма навчання (на основі базової та повної загальної середньої освіти)',
            text8: 'з 1 липня до 2 серпня 2020 року',
            text9: 'Бажаєте вступити до коледжу?',
            text10: 'Відвідайте розділ «Абітурієнтам» щоб дізнатися як вступити до коледжу, ознайомитися з правиламу прийому та документацією',
            text11: 'Перейти'
        },
        openDay: {
            head: 'День відкритих дверей',
            sub: 'Запрошуємо',
            text1: 'День відкритих дверей — це традиційний захід, у рамках якого вступники мають змогу отримати необхідну інформацію про навчання в коледжі та зробити перший крок до своєї освіти в Харківському патентно- комп’ютерний коледжі.',
            text2: 'У ході Дня відкритих дверей абітурієнти мають можливість дізнатися про напрями, за якими здійснюється підготовка в коледжі, та Правила прийому від представників Приймальної комісії. Вступники також отримують інформацію про особливості зовнішнього незалежного оцінювання в поточному навчальному році. Також проводяться зустрічі абітурієнтів та їхніх батьків із адміністрацією та вчителями, під час яких відвідувачі одержують детальну інформацію щодо наявних напрямів, дізнаються про навчальний процес та практики, перспективи працевлаштування випускників, організацію дозвілля та побуту студентів.',
            text3: 'Шановні абітурієнти!Справжній успіх приносить лише та робота, яку обирають за власним бажанням, відповідно до інтересів та здібностей. Сподіваємось, що Ви отримаете вичерпну інформацію про коледж та можливості, які отримує кожен його студент після навчання.',
            text4: 'На даному етапі Вашого життя важливо, бути активними і креативними у виборі професії та майбутнього.',
            text5: 'Місце проведення: ',
            text5Bold: 'м.Харків, вул.Ярослава Мудрого 18',
            text6: 'Додаткова інформація за телефонами:'
        },
        structurePage: {
            structureHead: 'Структура коледжу',
            adminsHead: 'Адміністрація коледжу',
            heads: 'Завідуючі відділеннями',
            teachersHead: 'Викладачі коледжу',
            admins: {
                mainAdmin: {
                    img: director,
                    fio: 'Луценко Сергій Степанович',
                    pos: 'директор коледжу'
                },
                fAdmin: {
                    img: nau,
                    fio: 'Наугольна',
                    pos: 'заступник директора коледжу'
                },
                sAdmin: {
                    img: net,
                    fio: "Ім'я Прізвище По-батькові",
                    pos: 'заступник директора з чогось'
                },
                tAdmin: {
                    img: gam,
                    fio: "Гамалєй Володимир Васильович",
                    pos: 'заступник директора з адміністративно-господарської роботи'
                }
            },
            chairmans: [{
                    img: director,
                    fio: "Ім'я прізвище по-батькові",
                    pos: 'завідуюча відділенням з ІПЗ'
                },
                {
                    img: director,
                    fio: "Ім'я прізвище по-батькові",
                    pos: 'завідуюча відділенням з ІПЗ'
                }
            ],
            teachers: [{
                    img: photo1,
                    fio: 'Усачьова Світлана Григорівна',
                    pos: 'викладач фізики'
                },
                {
                    img: photo2,
                    fio: 'Одуха Ніна Кузьмівна',
                    pos: 'викладач екології та біології'
                },
                {
                    img: photo3,
                    fio: 'Краснікова Наталя Василівна',
                    pos: 'викладач іноземної мови'
                },
                {
                    img: photo4,
                    fio: 'Клімова Олена Анатоліївна',
                    pos: 'викладач української мови'
                },
                {
                    img: photo5,
                    fio: 'Буділко Антоніна Павлівна',
                    pos: 'викладач дискретної математики'
                },
                {
                    img: photo6,
                    fio: 'Болотських Тетяна Василівна',
                    pos: 'викладач основ метрології і стандартизації'
                },
                {
                    img: photo7,
                    fio: 'Титова Ольга Дмитрівна',
                    pos: 'архітектура комп’ютерних систем'
                },
                {
                    img: photo8,
                    fio: 'Кулік Юлія Вікторівна',
                    pos: 'викладач професійних дисциплін'
                },
                {
                    img: photo9,
                    fio: 'Гордон Наталія Борисівна',
                    pos: "комп’ютерні мережі"
                },
                {
                    img: photo10,
                    fio: 'Мальцева Тетяна Іллівна',
                    pos: 'викладач професійних дисциплін'
                },
                {
                    img: photo11,
                    fio: 'Батирєва Тетяна Іванівана',
                    pos: 'викладач математики та інформатики'
                },
                {
                    img: photo12,
                    fio: 'Колупаєва Олена Юріївна',
                    pos: 'викладач економіки'
                },
                {
                    img: photo13,
                    fio: 'Катасонова Валентина Василівна',
                    pos: 'викладач соціології'
                },
                {
                    img: photo14,
                    fio: 'Дубовик Катерина Михайлівна',
                    pos: 'викладач професійних дисциплін'
                },
                {
                    img: photo15,
                    fio: 'Балабан Василь Павлович',
                    pos: 'викладач історії України та Всесвітньої історії'
                },
                {
                    img: fur,
                    fio: 'Фурсов Анатолій Митрофанович',
                    pos: 'викладач мікропроцесорних систем'
                },
                {
                    img: gry,
                    fio: 'Грищенко Олександр Іванович',
                    pos: 'фізичне виховання'
                },
                {
                    img: kos,
                    fio: 'Костюріна Тетяна Михайлівна',
                    pos: 'викладач теорії ймовірності та вищої математики'
                },
                {
                    img: kov,
                    fio: 'Ковальова Катерина Генадіївна',
                    pos: 'викладач української мови та літератури'
                },
                {
                    img: kor,
                    fio: 'Корнілова Тетяна Іванівна',
                    pos: 'викладач зарубіжної літератури'
                },
                {
                    img: sal,
                    fio: 'Салоїд Тетяна Петрівна',
                    pos: 'викладач математики'
                },
                {
                    img: pod,
                    fio: 'Поддяконова Валентина Григоріївна',
                    pos: 'викладач хімії'
                },
                {
                    img: tes,
                    fio: 'Тресницький Владислав Олександрович',
                    pos: 'викладач інструментів зовнішньо- візуального програмування'
                },
                {
                    img: net,
                    fio: "Прізвище ім'я по-батькові",
                    pos: 'викладач з чогось'
                },
            ]
        },
        achievements: {
            head: 'Досягнення коледжу',
            textF: 'Вже багато років поспіль наші учні демонструють успіхи на міжобласних та всеукраїнських змаганнях. Харківський патентно комп’ютерний коледж– це навчальний заклад, головним завданням якого є забезпечення підготовки конкурентоспроможного на ринку праці фахівця. У сфері провадження освітньої діяльності результат досягається високою професійною активністю педагогічних працівників: курсова передпідготовка, методична діяльність (методичні об ’єднання, творчі групи, тренінги, семінари), вивчення передового досвіду, проведення відкритих занять, взаємовідвідування занять, навчально-методична діяльність, самоосвіта, участь у предметних комісіях із загально-освітніх дисциплін.',
            textS: 'З метою вдосконалення фахової підготовки педагогічних кадрів проводиться методична робота, яка спонукає кожного педагога до підвищення свого фахового рівня. У процесі методичної роботи здійснюються підвищення наукового рівня педагогічного працівника, його підготовка до засвоєння змісту нових програм, постійне ознайомлення з досягненнями методик викладання, збагачення прогресивними методами та засобами навчання.',
            sub: 'Останні досягнення',
            years: [{
                    year: 2019,
                    yearText: '2019 рік',
                    go: 'Перейти'
                },
                {
                    year: 2018,
                    yearText: '2018 рік',
                    go: 'Перейти'
                }, {
                    year: 2017,
                    yearText: '2017 рік',
                    go: 'Перейти'
                }
            ]
        },
        workPage: {
            head: 'Працевлаштування',
            textF: 'Робота з працевлаштування випускників коледжу починається з зарахування студентів нового прийому. Студенти, які поступили на навчання на місця державного фінансування укладають угоди про працевлаштування після завершення навчання в коледжі.',
            textS: 'Для координації діяльності з працевлаштування у коледжі створена комісія з працевлаштування.',
            textT: 'Розроблено Положення про комісію Харківського патентно-комп’ютерного коледжу щодо сприяння працевлаштуванню студентів і випускників.Це Положення регламентує діяльність комісії коледжу щодо сприяння працевлаштуванню студентів і випускників з метою сприяння реалізації права студентів і випускників на працю та забезпеченню випускників першим робочим місцем.',
            bPartners: 'Основні партнери',
            comision: 'Комісія щодо сприяння працевлаштуванню студентів і випускників коледжу здійснює: налагодження ділових стосунків зі службами зайнятості населення, підприємствами, установами та організаціями (роботодавцями) з питань професійної підготовки та працевлаштування студентів і випускників; вивчення динаміки попиту на відповідних фахівців на ринку праці, надання відповідних пропозицій керівництву вищого навчального закладу; співпрацю з іншими підприємствами з питань працевлаштування студентів та випускників; надання консультацій студентам і випускникам з питань оформлення власного резюме; організацію практики студентів, щодо пошуку підприємств, установ та організацій (роботодавців).',
            oPartnets: 'Наші партнери'
        },
        historyPage: {
            history: 'Історія коледжу'
        },
        aboutPage: {
            head: 'Про коледж',
            why: 'Чому вступати до ХПКК?',
            whySub: 'Ми переконані, якщо ви оберете навчання саме у Харківському патентно- комп’ютерному коледжі, то ваше сумлінне ставлення до навчання, цілеспрямованість у поєднанні з нашою матеріальною базою та методичним забезпеченням, кадровим педагогічним потенціалом і багаторічним досвідом освітянської діяльності забезпечать вам конкурентоспроможний рівень професійної підготовки і для фахової діяльності, і для продовження навчання. Підтвердженням цьому є відгуки наших випускників.',
            responses: 'Відгуки випускників ХПКК',
            wannaGo: 'Бажаєте вступити до коледжу?',
            wannaText: 'Відвідайте розділ "Абітурієнтам" щоб дізнатися як вступити до коледжу, ознайомитися з правилами прийому та документацією',
            go: 'Перейти'
        },
        mainPage: {
            firstHead: 'Якісна освіта.',
            secondHead: 'Сторічна історія.',
            thirdHead: 'Десятки тисяч фахівців.',
            redBlockThin: '#Абітурієнтам_ХПКК',
            redBlockHead: 'День відкритих дверей',
            redBlockTime: '23 лютого о 17:00',
            redBlockMore: 'Детальніше',
            subHead: 'Світ невпинно рухається у напрямку, коли його нормальне функціонування повністю залежатиме від комп’ютерів. Вже на даний момент ми можемо спостерігати, як кожна галузь нашого персонального та професійного життя пов’язані з інформаційними технологіями. Ми використовуємо смарфони, в яких завантажені соціальні мережі, месенжери, відеочати, додатки доповненої реальності. Банки, лікарні, ресторани, комунальні служби, таксі: все це під’єднане до цифрової системи.Фантастичні фільми стають реальністю, технологій для цього цілком достатньо, а їх повне втілення лише питання часу.',
            eduF: 'Освітні партнери',
            eduS: 'Наші партнери'
        },
        headerPage: {
            header: {
                "Коледж": [{
                        label: 'Головна сторінка',
                        link: '/'
                    },
                    {
                        label: 'Новини',
                        link: '/news'
                    },
                    {
                        label: 'Про коледж',
                        link: '/about'
                    },
                    {
                        label: 'Історія коледжу',
                        link: '/history-of-college'
                    },
                    {
                        label: 'Структура коледжу',
                        link: '/structure'
                    },
                    {
                        label: 'Досягнення',
                        link: '/achievements'
                    },
                    {
                        label: 'Фотогалерея',
                        link: '/galery/1'
                    },
                    {
                        label: 'Працевлаштування',
                        link: '/work'
                    }
                ],
                "Студентам": [{
                        link: "/rating",
                        label: 'Стипендеальний рейтинг'
                    },
                    {
                        link: "/day-schedule",
                        label: 'Розклад занять'
                    },
                    {
                        link: "/replacements",
                        label: 'Заміни'
                    },
                    {
                        link: "/zno",
                        label: 'ЗНО'
                    },
                    {
                        link: "/exam-schedule",
                        label: 'Розклад іспитів'
                    }
                ],
                "Абітурієнтам": [{
                        link: "/open-day",
                        label: 'День відкритих дверей'
                    },
                    {
                        link: "/vstup",
                        label: 'Вступна компанія'
                    },
                    {
                        link: "/specialty",
                        label: 'Спеціальності'
                    },
                    {
                        link: "/contract",
                        label: 'Реквізити для оплати контракту'
                    },
                    {
                        link: "/consultation",
                        label: 'Підготовче відділення'
                    }
                ],
                "Прес-центр": [{
                        link: "",
                        label: 'Професійна кваліфікація'
                    },
                    {
                        link: "/public-info",
                        label: 'Публічна інформація'
                    },
                    {
                        link: "/financial-report",
                        label: 'Фінансовий звіт'
                    },
                    {
                        link: "/rights",
                        label: 'Правова інформація'
                    }
                ]
            },
            headerContacts: {
                link: "/contacts",
                label: 'Контакти'
            },
            headerLogoLetter: 'х',
            headerLogo: 'пкк',
            headerText: 'Харківський патентно-комп\'ютерний коледж',
        },
        footerPage: {
            contactsText: "Контакти",
            telephoneNumberCall: "+380 50 700 48 15",
            telephoneNumber: "+380 50 700 48 15",
            email: "help@compcollege.org",
            street: "Ярослава Мудрого, 18",
            footerIcons: [{
                    src: "",
                    alt: "F"
                },
                {
                    src: "",
                    alt: "T"
                },
                {
                    src: "",
                    alt: "I"
                }
            ],
            footerHFKF: [
                ["#ХКФК", " - це вчитися мріючи"],
                ["#ХКФК", " - це безліч цікавих івентів"],
                ["#ХКФК", " - це незабутні студентські роки"],
                ["#ХКФК", " - це успіх"]
            ]
        },
        responsePage: [{
                text: 'Закінчив в 2012 році за спеціальністю "Обслуговування комп\'ютерних систем і мереж". Вступив в ХАІ на "інженер програмного забезпечення" і з тих пір працюю по "інститутській" спеціальності. Що можу сказати з власного досвіду: ті, хто не хоче вчитися - не навчаться ніде. Ті, хто хочуть вчитися - тих навчать. Тут не вистачить місця, щоб повністю висловитися, але навіть зараз я по роботі періодично торкаюся того матеріалу, якому навчали в коледжі і дуже шкодую, що не приділяв навчанню більше часу',
                img: face2
            },
            {
                text: 'Коледж кращає. Благо, люди, які приходять сюди, намагаються донести студентам істини новіше, ніж ті, які студенти вивчали ще року 3 назад. Навчатися тут нескладно, головне - прагнення до цього. Більшість викладачів хороші фахівці і чудові люди. Коледж дав мені необхідний мінімум. Хороші викладачі, якщо щось не зрозумів пояснять на перерві або після пар. Пояснюють добре. Багато комп\'ютерів, не як в інших коледжах сидять по 3 людини.',
                img: face1
            },
            {
                text: 'Люблю свій рідний ХПКК!  Мені тут подобається абсолютно все, хороша атмосфера, професіні викладачі і зручне місце розташування! Я дуже рада що обрала саме Харківський патентно- комп’ютерний коледж серед всіх інших коледжів Харкова.',
                img: face4
            },
            {
                text: 'ХПКК мені подобається. Випустилась рік тому. Головне влитися в навчальний процес. Тоді все буде: знання, успішність, упевненість в майбутньому. Пари проходять цікаво, професійні викладачі, цікаво спілкуватися з такими людьми. Взагалі все в колледжі классно !!! Якість навчання на гідному рівні, ХПКК рекомендую. Взагалі, все залежить тільки від вас самих: ніхто за вас не буде вивчати матеріал, складати іспити. Всім удачі!',
                img: face3
            },
        ],
        structureModalPage: {
            headMain: {
                img: r36,
                fio: 'Прізвище Ім’я По-батькові',
                rank: 'голова циклової комісії з програмування',
                back: 'Back text'

            },
            default: [{
                    img: r36,
                    fio: 'Прізвище Ім’я По-батькові',
                    rank: 'голова циклової комісії з програмування',
                    back: 'Back text'
                }, {
                    img: r36,
                    fio: 'Прізвище Ім’я По-батькові',
                    rank: 'голова циклової комісії з програмування',
                    back: 'Back text'
                },
                {
                    img: r36,
                    fio: 'Прізвище Ім’я По-батькові',
                    rank: 'голова циклової комісії з програмування',
                    back: 'Back text'
                },
                {
                    img: r36,
                    fio: 'Прізвище Ім’я По-батькові',
                    rank: 'голова циклової комісії з програмування',
                    back: 'Back text'
                },
                {
                    img: r36,
                    fio: 'Прізвище Ім’я По-батькові',
                    rank: 'голова циклової комісії з програмування',
                    back: 'Back text'
                },
                {
                    img: r36,
                    fio: 'Прізвище Ім’я По-батькові',
                    rank: 'голова циклової комісії з програмування',
                    back: 'Back text'
                }
            ]
        },
        coursePage: {
            "121": {
                "1": {
                    "1": "/schedules?course=1&group=1",
                    "2": "/schedules?course=1&group=2",
                    "3": "/schedules?course=1&group=3",
                },
                "2": {
                    "1": "/schedules?course=2&group=1",
                    "2": "/schedules?course=2&group=2",
                    "3": "/schedules?course=2&group=3",
                },
                "3": {
                    "1": "/schedules?course=3&group=1",
                    "2": "/schedules?course=3&group=2",
                    "3": "/schedules?course=3&group=3",
                },
                "4": {
                    "1": "/schedules?course=4&group=1",
                    "2": "/schedules?course=4&group=2",
                    "3": "/schedules?course=4&group=3",
                }
            },
            "123": {
                "1": {
                    "4": "/schedules?course=1&group=4",
                    "5": "/schedules?course=1&group=5",
                },
                "2": {
                    "4": "/schedules?course=2&group=4",
                    "5": "/schedules?course=2&group=5",
                },
                "3": {
                    "4": "/schedules?course=3&group=4",
                    "5": "/schedules?course=3&group=5",
                },
                "4": {
                    "4": "/schedules?course=4&group=4",
                    "5": "/schedules?course=4&group=5",
                }
            }
        },
        zaminyPage: {
            "121": {
                "1": {
                    "1": "/replacementPage?course=1&group=1",
                    "2": "/replacementPage?course=1&group=2",
                    "3": "/replacementPage?course=1&group=3",
                },
                "2": {
                    "1": "/replacementPage?course=2&group=1",
                    "2": "/replacementPage?course=2&group=2",
                    "3": "/replacementPage?course=2&group=3",
                },
                "3": {
                    "1": "/replacementPage?course=3&group=1",
                    "2": "/replacementPage?course=3&group=2",
                    "3": "/replacementPage?course=3&group=3",
                },
                "4": {
                    "1": "/replacementPage?course=4&group=1",
                    "2": "/replacementPage?course=4&group=2",
                    "3": "/replacementPage?course=4&group=3",
                }
            },
            "123": {
                "1": {
                    "4": "/replacementPage?course=1&group=4",
                    "5": "/replacementPage?course=1&group=5",
                },
                "2": {
                    "4": "/replacementPage?course=2&group=4",
                    "5": "/replacementPage?course=2&group=5",
                },
                "3": {
                    "4": "/replacementPage?course=3&group=4",
                    "5": "/replacementPage?course=3&group=5",
                },
                "4": {
                    "4": "/replacementPage?course=4&group=4",
                    "5": "/replacementPage?course=4&group=5",
                }
            }
        },
        unitPage: {
            "1": [{
                    date: '16.03.2020',
                    day: 'Понеділок',
                    schedule: {
                        "1": 'Математика',
                        "2": 'Українська мова'
                    }
                },
                {
                    date: '17.03.2020',
                    day: 'Вівторок',
                    schedule: {}
                },
                {
                    date: '18.03.2020',
                    day: 'Середа',
                    schedule: {
                        "1": 'Українська мова',
                        "2": 'Математика'
                    }
                },
                {
                    date: '19.03.2020',
                    day: 'Четвер',
                    schedule: {}
                },
                {
                    date: '20.03.2020',
                    day: 'П\'ятниця',
                    schedule: {}
                },
                {
                    date: '21.03.2020',
                    day: 'Субота',
                    schedule: {}
                }
            ],
            "2": [{
                    date: '16.03.2020',
                    day: 'Понеділок',
                    schedule: {
                        "1": 'Математика',
                        "2": 'Українська мова'
                    }
                },
                {
                    date: '17.03.2020',
                    day: 'Вівторок',
                    schedule: {}
                },
                {
                    date: '18.03.2020',
                    day: 'Середа',
                    schedule: {
                        "1": 'Українська мова',
                        "2": 'Математика'
                    }
                },
                {
                    date: '19.03.2020',
                    day: 'Четвер',
                    schedule: {}
                },
                {
                    date: '20.03.2020',
                    day: 'П\'ятниця',
                    schedule: {}
                },
                {
                    date: '21.03.2020',
                    day: 'Субота',
                    schedule: {}
                }
            ],
            "3": [{
                    date: '16.03.2020',
                    day: 'Понеділок',
                    schedule: {
                        "1": 'Математика',
                        "2": 'Українська мова'
                    }
                },
                {
                    date: '17.03.2020',
                    day: 'Вівторок',
                    schedule: {}
                },
                {
                    date: '18.03.2020',
                    day: 'Середа',
                    schedule: {
                        "1": 'Українська мова',
                        "2": 'Математика'
                    }
                },
                {
                    date: '19.03.2020',
                    day: 'Четвер',
                    schedule: {}
                },
                {
                    date: '20.03.2020',
                    day: 'П\'ятниця',
                    schedule: {}
                },
                {
                    date: '21.03.2020',
                    day: 'Субота',
                    schedule: {}
                }
            ],
            "13": [{
                    date: '16.03.2020',
                    day: 'Понеділок',
                    schedule: {
                        "1": 'Математика',
                        "2": 'Українська мова'
                    }
                },
                {
                    date: '17.03.2020',
                    day: 'Вівторок',
                    schedule: {}
                },
                {
                    date: '18.03.2020',
                    day: 'Середа',
                    schedule: {
                        "1": 'Українська мова',
                        "2": 'Математика'
                    }
                },
                {
                    date: '19.03.2020',
                    day: 'Четвер',
                    schedule: {}
                },
                {
                    date: '20.03.2020',
                    day: 'П\'ятниця',
                    schedule: {}
                },
                {
                    date: '21.03.2020',
                    day: 'Субота',
                    schedule: {}
                }
            ],
            "14": [{
                    date: '16.03.2020',
                    day: 'Понеділок',
                    schedule: {
                        "1": 'Математика',
                        "2": 'Українська мова'
                    }
                },
                {
                    date: '17.03.2020',
                    day: 'Вівторок',
                    schedule: {}
                },
                {
                    date: '18.03.2020',
                    day: 'Середа',
                    schedule: {
                        "1": 'Українська мова',
                        "2": 'Математика'
                    }
                },
                {
                    date: '19.03.2020',
                    day: 'Четвер',
                    schedule: {}
                },
                {
                    date: '20.03.2020',
                    day: 'П\'ятниця',
                    schedule: {}
                },
                {
                    date: '21.03.2020',
                    day: 'Субота',
                    schedule: {}
                }
            ],
            "15": [{
                    date: '16.03.2020',
                    day: 'Понеділок',
                    schedule: {
                        "1": 'Математика',
                        "2": 'Українська мова'
                    }
                },
                {
                    date: '17.03.2020',
                    day: 'Вівторок',
                    schedule: {}
                },
                {
                    date: '18.03.2020',
                    day: 'Середа',
                    schedule: {
                        "1": 'Українська мова',
                        "2": 'Математика'
                    }
                },
                {
                    date: '19.03.2020',
                    day: 'Четвер',
                    schedule: {}
                },
                {
                    date: '20.03.2020',
                    day: 'П\'ятниця',
                    schedule: {}
                },
                {
                    date: '21.03.2020',
                    day: 'Субота',
                    schedule: {}
                }
            ]
        },
        awardPage: {
            "2019": {
                img1: bitmap,
                img2: bitmap,
                text: 'Lorem, ipsum dolor sit amet consectetur adipisicing elit. Voluptates repellendus officia a aperiam reiciendis provident enim. Tenetur rerum reprehenderit deserunt dolorem earum vitae? Ipsum quaerat corrupti voluptates reiciendis corporis cupiditate molestias consectetur quod porro iste architecto, culpa, tempora laborum. In dolorem asperiores excepturi ipsam culpa minus iusto porro accusamus illum voluptates suscipit vitae inventore error facilis, dignissimos corrupti unde! Nesciunt ipsam sapiente aperiam laudantium? Magni corrupti nisi quia natus temporibus in exercitationem veritatis reprehenderit esse? Modi ad repudiandae molestias asperiores non odit incidunt! Error aut, odio officia dignissimos obcaecati, ipsa nam vitae atque qui maiores nostrum ipsam soluta rerum illum.',
                year: 2019
            },
            "2018": {
                img1: bitmap,
                img2: bitmap,
                text: 'Lorem, ipsum dolor sit amet consectetur adipisicing elit. Voluptates repellendus officia a aperiam reiciendis provident enim. Tenetur rerum reprehenderit deserunt dolorem earum vitae? Ipsum quaerat corrupti voluptates reiciendis corporis cupiditate molestias consectetur quod porro iste architecto, culpa, tempora laborum. In dolorem asperiores excepturi ipsam culpa minus iusto porro accusamus illum voluptates suscipit vitae inventore error facilis, dignissimos corrupti unde! Nesciunt ipsam sapiente aperiam laudantium? Magni corrupti nisi quia natus temporibus in exercitationem veritatis reprehenderit esse? Modi ad repudiandae molestias asperiores non odit incidunt! Error aut, odio officia dignissimos obcaecati, ipsa nam vitae atque qui maiores nostrum ipsam soluta rerum illum.',
                year: 2018
            },
            "2017": {
                img1: bitmap,
                img2: bitmap,
                text: 'Lorem, ipsum dolor sit amet consectetur adipisicing elit. Voluptates repellendus officia a aperiam reiciendis provident enim. Tenetur rerum reprehenderit deserunt dolorem earum vitae? Ipsum quaerat corrupti voluptates reiciendis corporis cupiditate molestias consectetur quod porro iste architecto, culpa, tempora laborum. In dolorem asperiores excepturi ipsam culpa minus iusto porro accusamus illum voluptates suscipit vitae inventore error facilis, dignissimos corrupti unde! Nesciunt ipsam sapiente aperiam laudantium? Magni corrupti nisi quia natus temporibus in exercitationem veritatis reprehenderit esse? Modi ad repudiandae molestias asperiores non odit incidunt! Error aut, odio officia dignissimos obcaecati, ipsa nam vitae atque qui maiores nostrum ipsam soluta rerum illum.',
                year: 2017
            },
            "2016": {
                img1: bitmap,
                img2: bitmap,
                text: 'Lorem, ipsum dolor sit amet consectetur adipisicing elit. Voluptates repellendus officia a aperiam reiciendis provident enim. Tenetur rerum reprehenderit deserunt dolorem earum vitae? Ipsum quaerat corrupti voluptates reiciendis corporis cupiditate molestias consectetur quod porro iste architecto, culpa, tempora laborum. In dolorem asperiores excepturi ipsam culpa minus iusto porro accusamus illum voluptates suscipit vitae inventore error facilis, dignissimos corrupti unde! Nesciunt ipsam sapiente aperiam laudantium? Magni corrupti nisi quia natus temporibus in exercitationem veritatis reprehenderit esse? Modi ad repudiandae molestias asperiores non odit incidunt! Error aut, odio officia dignissimos obcaecati, ipsa nam vitae atque qui maiores nostrum ipsam soluta rerum illum.',
                year: 2016
            },
            "2015": {
                img1: bitmap,
                img2: bitmap,
                text: 'Lorem, ipsum dolor sit amet consectetur adipisicing elit. Voluptates repellendus officia a aperiam reiciendis provident enim. Tenetur rerum reprehenderit deserunt dolorem earum vitae? Ipsum quaerat corrupti voluptates reiciendis corporis cupiditate molestias consectetur quod porro iste architecto, culpa, tempora laborum. In dolorem asperiores excepturi ipsam culpa minus iusto porro accusamus illum voluptates suscipit vitae inventore error facilis, dignissimos corrupti unde! Nesciunt ipsam sapiente aperiam laudantium? Magni corrupti nisi quia natus temporibus in exercitationem veritatis reprehenderit esse? Modi ad repudiandae molestias asperiores non odit incidunt! Error aut, odio officia dignissimos obcaecati, ipsa nam vitae atque qui maiores nostrum ipsam soluta rerum illum.',
                year: 2015
            }
        },
        achievementsPage: {
            "2017": {
                head: "Участь у Міжнародній олімпіаді з програмування Кубок Вєкуа",
                text: [
                    '<p class="sub-main-text">28-29 жовтня 2017 року студенти коледжу приймали участь у Міжнародній олімпіаді з програмування «Кубок «Вєкуа»».</p>',
                    '<p class="sub-main-text">Олімпіада проводилася в 2 тури: індивідуальний та командний. В олімпіаді приймали участь студенти Вищих навчальних закладів Грузії, України, Білорусі, Азербайджану, Росії. Харківським студентам базову площадку для участі в олімпіаді надав ХНУРЕ.</p>',
                    '<p class="sub-main-text">Студенти патентно-комп’ютерного коледжу приймали участь в обох турах та показали чудові результати.</p>',
                    '<p class="sub-main-text">В індивідуальному турі студенти Дмитро Дородних (гр.П-41), Костянтин Кравчик (гр.П-41), В’ячеслав Коцюба (гр.П-52), Константинов Владислав (гр.П-52), Марина Кудрявцева (гр.П-42) увійшли до сотні кращих.</p>',
                    '<p class="sub-main-text">В командному турі від коледжу приймали участь 4 команди: DeusVult (Кравчик Костянтин, Дородних Дмитро та Радченко Владислава), GoldSun (Коцюба В’ячеслав, Константинов Владислав та Мусієнко Олексій), HPPTeam (Мамедов Тимур, Кудрявцева Марина, Кіяшкін Максим), CyberCloud (Хамідов Далер , Подопригора Данило).</p>',
                    '<p class="sub-main-text">Наші команди DeusVult та GoldSun випередили команди НТУ «ХПІ» та ХНЕУ та всього на дві позиції відстали від команди ХНУРЕ «ZeroDay».</p>',
                    '<p class="sub-main-text">Вітаємо наших учасників!</p>'
                ]
            },
            "2018": {
                head: "ХПКК: перше місце у обласному англомовному брейн-ринзі з комп’ютерних наук",
                text: [
                    "<p class=\"sub-main-text\">1 лютого 2018 р.</p>",
                    "<p class=\"sub-main-text\">Команда Харківського патентно – комп’ютерного коледжу ” Sunny Side” посіла I місце у обласному англомовному брейн-ринзі з комп’ютерних наук. Захід проходив на базі ХРТТ,    у грі приймали участь 10-ть команд від ВНЗ І-ІІ рівнів акредитації.  </p>",
                    "<p class=\"sub-main-text\">Вільне володіння англійською, професійні знання, командна згуртованість, позитивний настрій та віра у власні сили привели до перемоги нашу команду.   </p>",
                    '<p class="sub-main-text">Члени команди</p>',
                    '<p class="sub-main-text">Книш Олексій (П71) капітан команди  </p>',
                    '<p class="sub-main-text">Євтушенко Сергій (П62) </p>',
                    '<p class="sub-main-text">Півень Назар (П71) </p>',
                    '<p class="sub-main-text">Григоров Єгор (П71) </p>',
                    '<p class="sub-main-text">Касумов Богдан (П62) </p>',
                    '<p class="sub-main-text">Анахін Георгій (П62) </p>',
                    '<p class="sub-main-text">У четвертому раунді команда “Sunny Side” виборола право змагатися у фіналі гри. </p>',
                    `<img src=${ach1} alt="ach1" />`,
                    '<p class="sub-main-text">Фінальна гра. Напруження та зосередженість. </p>',
                    `<img src=${ach2} alt="ach2" />`,
                    '<p class="sub-main-text">Нагородження команди. Грамота та солодкі подарунки. </p>',
                    `<img src=${ach3} alt="ach3" />`,
                    '<p class="sub-main-text">Фінальне фото на згадку про приємні та радісні емоції. </p>',
                    `<img src=${ach4} alt="ach4" />`,
                ]
            },
            "2019": {
                head: "Літературно-мовний конкурс імені Тараса Шевченка",
                text: [
                    '<p class="sub-main-text">На базі Харківського патентно-комп’ютерного коледжу пройшов обласний етап X-го міжнародного літературно-мовного конкурсу імені Тараса Шевченка.</p>'
                ]
            }
        },
    },
    EN: {
        examPage: {
            head: 'Exam schedule',
            sub1: '121 "Software Engineering"',
            text2: '1 course',
            text3: '2 course',
            text4: '3 course',
            text5: '4 course',
            text2A: 'Go',
            text3A: 'Go',
            text4A: 'Go',
            text5A: 'Go',
            sub2: '123 "Computer Engineering"',
            text6: '1 course',
            text7: '2 course',
            text8: '3 course',
            text9: '4 course',
            text6A: 'Go',
            text7A: 'Go',
            text8A: 'Go',
            text9A: 'Go'
        },
        znoPage: {
            head: 'Exams',
            text: 'Exams'
        },
        zaminy: {
            head: 'Substitutions in the class schedule',
            sub1: '121 "Software Engineering"',
            text2: '1 course',
            text3: '2 course',
            text4: '3 course',
            text5: '4 course',
            text2A: 'Go',
            text3A: 'Go',
            text4A: 'Go',
            text5A: 'Go',
            sub2: '123 "Computer Engineering"',
            text6: '1 course',
            text7: '2 course',
            text8: '3 course',
            text9: '4 course',
            text6A: 'Go',
            text7A: 'Go',
            text8A: 'Go',
            text9A: 'Go'
        },
        daySchedulePage: {
            head: 'Class schedule',
            sub1: 'Full-time students for the period from February 1 to June 31, 2020',
            pdfText: 'Schedule of the educational process',
            sub2: '121 "Software Engineering"',
            text2: '1 course',
            text3: '2 course',
            text4: '3 course',
            text5: '4 course',
            text2A: 'Go',
            text3A: 'Go',
            text4A: 'Go',
            text5A: 'Go',
            sub3: '123 "Computer Engineering"',
            text6: '1 course',
            text7: '2 course',
            text8: '3 course',
            text9: '4 course',
            text6A: 'Go',
            text7A: 'Go',
            text8A: 'Go',
            text9A: 'Go'
        },
        ratingPage: {
            head: 'Scholarship rating',
            pdfText: 'Provisions on scholarships KPCC',
            sub1: '121 "Software Engineering"',
            text1: 'Last update 20.20.2020',
            text2: '1 course',
            text3: '2 course',
            text4: '3 course',
            text5: '4 course',
            text2A: 'Go',
            text3A: 'Go',
            text4A: 'Go',
            text5A: 'Go',
            sub2: '123 "Computer Engineering"',
            text10: 'Last update 20.20.2020',
            text6: '1 course',
            text7: '2 course',
            text8: '3 course',
            text9: '4 course',
            text6A: 'Go',
            text7A: 'Go',
            text8A: 'Go',
            text9A: 'Go'
        },
        publicPage: {
            head: 'Access to public information',
            text1: 'The purpose of the Law of Ukraine "On Access to Public Information" is to ensure transparency and openness of the subjects of power and to create mechanisms for the exercise of the right of everyone to access public information.',
            text2: 'According to the Law of Ukraine "On Access to Public Information", public information is information reflected and documented by any means and on any media, which was received or created in the process of performing by the subjects of power their duties under the current legislation, or which is in the possession of subjects of power, other managers of public information, defined by this Law.',
            text3: 'This Law does not apply to relations concerning the receipt of information by subjects of power in the exercise of their functions, as well as to relations in the field of citizens\' appeals, which are regulated by a special law.',
            text4: 'Public information created in the course of the activity of the Ministry of Education and Science of Ukraine is provided in response to a request for public information.',
            text5: 'Document 1'
        },
        consultationPage: {
            head: 'Advice before joining',
            text1: 'Ukrainian language',
            text2: 'Math',
            text3: 'Convenient schedule',
            text4: 'Near the subway',
            text5: 'Attractive conditions',
            text6: 'Quality education',
            text7: 'Preparatory courses for admission to the College are a good start for comfortable learning in the future. Since we must not forget the fact that future students of the College are primarily adolescents and it is very important not to miss the period of adaptation in the new learning environment, the possibility of implementing variable teaching methods in the educational process, get used to the teaching methods used by higher education teachers. to practice at the College until admission.',
            text8: 'The pre-university training department offers you training courses twice a week. Number of students in groups - up to 30 people. Classes are conducted by highly qualified teachers of COD. They help entrants to systematize the school curriculum and learn new learning materials, as well as to successfully prepare for',
            text9: 'Consultation schedule',
            text10: 'Group 1',
            text10A: 'Go',
            text11: 'Group 2',
            text11A: 'Go',
            text12: 'Group 3',
            text12A: 'Go',
            text13: 'Group 4',
            text13A: 'Go'
        },
        contractPage: {
            head: 'Details for contract payment',
            text1Bold: 'Recipient\'s code',
            text1: '123456789',
            text2Bold: "Beneficiary's account",
            text2: '123456789',
            text3Bold: "Beneficiary's bank",
            text3: 'Bank of Ukraine'
        },
        specialtyPage: {
            head: 'Specialties',
            sub1: '121 "Software Engineering',
            text1: 'The program of specialty 121 "Software Engineering" focuses on the training of qualified specialists in software engineering, which aims to develop software systems that work reliably and efficiently, the cost of development and maintenance of which is affordable, and which meet the requirements of customers. Today, software engineers are the most in demand in the labor market among other IT professionals, they participate in the development of domestic and international software projects, and have a decent pay for their work. The demand for software engineering professionals will only grow in the future.',
            text2: 'Main specializations:',
            text3: 'Applied programming (with in-depth study of specialized disciplines)',
            text4: 'Web-programming: site development',
            text5: 'Blockchain and application software',
            sub2: '123 "Computer Engineering"',
            text6: 'Technology: knowledge of computers, their assembly, testing and repair, programming, Internet services and mobile technologies.',
            text7: 'Mathematics: design of software applications and smart hardware, cyber security, antivirus, design of digital systems on crystals and computer networks.',
            text8: 'Field of programming for the labor market: C ++, Java, Python, .NET, C #, VHDL, Verilog, System C.',
            text9: 'Skills and competencies that a graduate in Computer Engineering will have:',
            text10: '1. Development and maintenance of systems and networks running Windows, Unix, Linux;',
            text11: '2. Creation of wireless means of communication, development of software products by means of language means of high and low levels of C ++, C #, Java, Python, Assembler and microminiature digital systems on crystals;',
            text12: '3. Development of user and system interfaces, hardware and software compilers, intelligent programming systems and knowledge base design;',
            text13: '4. Big data analysis;',
            text14: '5. Design of cloud services and mobile applications, smart devices integrated with Internet networks.'
        },
        vstupPage: {
            head: 'Admission to the programs of young specialists',
            text1: 'Kharkiv Patent and Computer College invites you to continue your studies at our educational institution. We offer you professions that are in great demand in software development and computer - the leading sectors of our economy.',
            text2: 'For more information, please refer to the section ',
            text2A: '«Contacts»',
            text3: 'or visit at ',
            text3A: '«Open Day»',
            text4: 'To all who come to us for training, we guarantee quality general education, general technical and professional training, which will allow everyone to become a skilled, competitive worker and master of their craft.',
            icon1: {
                frontText: 'Form of study',
                backText: 'Full-time, couples attend college'
            },
            icon2: {
                frontText: 'Specialties',
                backText: '"121" - Software Engineering "123" - Computer Engineering'
            },
            icon3: {
                frontText: 'Duration of training',
                backText: 'The training lasts 4 academic years'
            },
            icon4: {
                frontText: 'Admission rules',
                backText1: 'You can read the rules of admission on the page',
                backText1A: '"Admission to the Junior Specialist Program"'
            },
            text5: 'College education is possible in specialties',
            text6: '121 "Software Engineering"',
            text6A: 'Cost of education',
            text12: '123 "Computer Engineering"',
            text12A: 'Cost of education',
            sub: 'Schedule of the introductory campaign',
            text7: 'Full-time education (based on basic and complete general secondary education)',
            text8: 'from July 1 to August 2, 2020',
            text9: 'Want to go to college?',
            text10: 'Visit the "Applicants" section to learn how to enter the college, read the rules of admission and documentation',
            text11: 'Go'
        },
        openDay: {
            head: 'Open Day',
            sub: 'Welcome',
            text1: 'The Open Day is a traditional event, in which entrants have the opportunity to get the necessary information about studying at the college and take the first step towards their education at the Kharkiv Patent and Computer College.',
            text2: 'During the Open Day, entrants have the opportunity to learn about the areas in which training is carried out in the college, and the Rules of Admission from the representatives of the Admissions Committee. Applicants also receive information about the features of external independent assessment in the current academic year. There are also meetings of applicants and their parents with the administration and teachers, during which visitors receive detailed information on available areas, learn about the educational process and practices, employment prospects of graduates, organization of leisure and life of students.',
            text3: 'Dear entrants, real success is brought only by the work that is chosen at will, according to interests and abilities. We hope that you will receive comprehensive information about the college and the opportunities that each of its students receives after their studies.',
            text4: 'At this stage of your life it is important to be active and creative in choosing a profession and the future.',
            text5: 'Venue',
            text5Bold: 'Kharkiv, 18 Yaroslava Mudryho Street',
            text6: 'Additional information by phone:'
        },
        structurePage: {
            structureHead: 'Structure of the college',
            adminsHead: 'College administration',
            heads: 'Heads of departments',
            teachersHead: 'College teachers',
            admins: {
                mainAdmin: {
                    img: director,
                    fio: 'Lutsenko Serhiy Stepanovych',
                    pos: 'director of the college'
                },
                fAdmin: {
                    img: nau,
                    fio: "Nauhol'na",
                    pos: 'deputy director of the college'
                },
                sAdmin: {
                    img: net,
                    fio: "Name Surname Patronymic",
                    pos: 'deputy director of something'
                },
                tAdmin: {
                    img: gam,
                    fio: "Hamaliey Volodymyr Vasyliovych",
                    pos: 'deputy director for administrative and economic affairs'
                }
            },
            chairmans: [{
                    img: director,
                    fio: "Name Surname Patronymic",
                    pos: 'deputy director of something'
                },
                {
                    img: director,
                    fio: "Name Surname Patronymic",
                    pos: 'deputy director of something'
                }
            ],
            teachers: [{
                    img: photo1,
                    fio: 'Uschiova Svitlana Hryhorivna',
                    pos: 'physics teacher'
                },
                {
                    img: photo2,
                    fio: 'Odukha Nina Kuzmivna',
                    pos: 'teacher of ecology and biology'
                },
                {
                    img: photo3,
                    fio: 'Krasnikova Natalia Vasylivna',
                    pos: 'foreign language teacher'
                },
                {
                    img: photo4,
                    fio: 'Klimova Elena Anatoliyivna',
                    pos: 'Ukrainian language teacher'
                },
                {
                    img: photo5,
                    fio: 'Budilko Antonina Pavlovna',
                    pos: 'teacher of discrete mathematics'
                },
                {
                    img: photo6,
                    fio: 'Bolotsky Tetyana Vasylivna',
                    pos: 'teacher of basics of metrology and standardization'
                },
                {
                    img: photo7,
                    fio: "Tytova Ol'ha Dmytrivna",
                    pos: 'computer systems architecture'
                },
                {
                    img: photo8,
                    fio: 'Kulik Yuliya Viktorivna',
                    pos: 'teacher of professional disciplines'
                },
                {
                    img: photo9,
                    fio: 'Hordon Natalia Borysivna',
                    pos: "computer networks"
                },
                {
                    img: photo10,
                    fio: "Mal'tseva Tetyana Illivna",
                    pos: 'teacher of professional disciplines'
                },
                {
                    img: photo11,
                    fio: 'Batyreva Tetiana Ivanivna',
                    pos: 'teacher of mathematics and computer science'
                },
                {
                    img: photo12,
                    fio: 'Kolupaeva Elena Yuriyivna',
                    pos: 'teacher of economics'
                },
                {
                    img: photo13,
                    fio: 'Katasonova Valentina Vasylivna',
                    pos: 'teacher of sociology'
                },
                {
                    img: photo14,
                    fio: 'Dubovyk Kateryna Mykhailivna',
                    pos: 'teacher of professional disciplines'
                },
                {
                    img: photo15,
                    fio: 'Balaban Vasil Pavlovich',
                    pos: 'teacher of Ukrainian history and world history'
                },
                {
                    img: fur,
                    fio: 'Fursov Anatoly Mitrofanovich',
                    pos: 'teacher of microprocessor systems'
                },
                {
                    img: gry,
                    fio: 'Grishchenko Olexandr Ivanovych',
                    pos: 'Physical Education'
                },
                {
                    img: kos,
                    fio: 'Kostyurina Tetyana Mykhailivna',
                    pos: 'teacher of probability theory and higher mathematics'
                },
                {
                    img: kov,
                    fio: 'Kovaleva Kateryna Genadiivna',
                    pos: 'teacher of Ukrainian language and literature'
                },
                {
                    img: kor,
                    fio: 'Kornilova Tetyana Ivanivna',
                    pos: 'teacher of foreign literature'
                },
                {
                    img: sal,
                    fio: 'Saloyid Tetiana Petrivna',
                    pos: 'mathematics teacher'
                },
                {
                    img: pod,
                    fio: 'Poddyakonova Valentina Grigorievna',
                    pos: 'chemistry teacher'
                },
                {
                    img: tes,
                    fio: 'Vladislav Oleksandrovych Tresnytsky',
                    pos: 'teacher of external visual programming tools'
                },
                {
                    img: net,
                    fio: "Full Name",
                    pos: 'teacher from something'
                },
            ]
        },
        historyPage: {
            history: 'History of the college'
        },
        aboutPage: {
            head: 'About the college',
            why: 'Why join the KPCC?',
            whySub: 'We are convinced that if you choose to study at Kharkiv Patent and Computer College, then your conscientious attitude to education, purposefulness combined with our material base and methodological support, personnel pedagogical potential and many years of experience in educational activities will provide you with a competitive level of training and for professional activities, and for further study. This is confirmed by the feedback of our graduates.',
            responses: 'Reviews of KPCC graduates',
            wannaGo: 'Want to go to college?',
            wannaText: 'Visit the "Applicants" section to learn how to enter the college, read the rules of admission and documentation',
            go: 'Go'
        },
        mainPage: {
            firstHead: 'Quality education.',
            secondHead: 'Century history.',
            thirdHead: 'Tens of thousands of specialists.',
            redBlockThin: '#To_Appliers_KPCC',
            redBlockHead: 'Open Day',
            redBlockTime: '23 February at 17:00',
            redBlockMore: 'More',
            subHead: 'The world is constantly moving in a direction where its normal functioning will be completely dependent on computers. We can already see how every area of ​​our personal and professional life is related to information technology. We use smartphones, which are loaded with social networks, messengers, video chats, augmented reality applications. Banks, hospitals, restaurants, utilities, taxis: all this is connected to the digital system. Fantastic movies are becoming a reality, technology is enough for this, and their full implementation is only a matter of time.',
            eduF: 'Educational partners',
            eduS: 'Our partners'
        },
        headerPage: {
            header: {
                "College": [{
                        label: 'Main page',
                        link: '/'
                    },
                    {
                        label: 'News',
                        link: '/news/1'
                    },
                    {
                        label: 'About the college',
                        link: '/about'
                    },
                    {
                        label: 'History of the college',
                        link: '/history-of-college'
                    },
                    {
                        label: 'Structure of the college',
                        link: '/structure'
                    },
                    {
                        label: 'Achievements',
                        link: '/achievements'
                    },
                    {
                        label: 'Galery',
                        link: '/galery/1'
                    },
                    {
                        label: 'Employment',
                        link: '/work'
                    },
                ],
                "To students": [{
                        link: "/rating",
                        label: 'Rating'
                    },
                    {
                        link: "/day-schedule",
                        label: 'Day schedule'
                    },
                    {
                        link: "/replacements",
                        label: 'Replacements'
                    },
                    {
                        link: "/zno",
                        label: 'ZNO'
                    },
                    {
                        link: "/exam-schedule",
                        label: 'Exam schedule'
                    }
                ],
                "To applicants": [{
                        link: "/open-day",
                        label: 'Open day'
                    },
                    {
                        link: "/vstup",
                        label: 'Introductory campaign'
                    },
                    {
                        link: "/specialty",
                        label: 'Specialty'
                    },
                    {
                        link: "/contract",
                        label: 'Details for contract payment'
                    },
                    {
                        link: "/consultation",
                        label: 'Preparatory department'
                    }
                ],
                "Press center": [{
                        link: "",
                        label: 'Professional qualification'
                    },
                    {
                        link: "/public-info",
                        label: 'Public information'
                    },
                    {
                        link: "/financial-report",
                        label: 'Financial Report'
                    },
                    {
                        link: "/rights",
                        label: 'Legal information'
                    }
                ]
            },
            headerContacts: {
                link: "/contacts",
                label: 'Contacts'
            },
            headerLogoLetter: 'k',
            headerLogo: 'pcc',
            headerText: 'Kharkiv Patent and Computer College'
        },
        responsePage: [{
                text: 'Закінчив в 2012 році за спеціальністю "Обслуговування комп\'ютерних систем і мереж". Вступив в ХАІ на "інженер програмного забезпечення" і з тих пір працюю по "інститутській" спеціальності. Що можу сказати з власного досвіду: ті, хто не хоче вчитися - не навчаться ніде. Ті, хто хочуть вчитися - тих навчать. Тут не вистачить місця, щоб повністю висловитися, але навіть зараз я по роботі періодично торкаюся того матеріалу, якому навчали в коледжі і дуже шкодую, що не приділяв навчанню більше часу',
                img: face2
            },
            {
                text: 'Коледж кращає. Благо, люди, які приходять сюди, намагаються донести студентам істини новіше, ніж ті, які студенти вивчали ще року 3 назад. Навчатися тут нескладно, головне - прагнення до цього. Більшість викладачів хороші фахівці і чудові люди. Коледж дав мені необхідний мінімум. Хороші викладачі, якщо щось не зрозумів пояснять на перерві або після пар. Пояснюють добре. Багато комп\'ютерів, не як в інших коледжах сидять по 3 людини.',
                img: face1
            },
            {
                text: 'Люблю свій рідний ХПКК!  Мені тут подобається абсолютно все, хороша атмосфера, професіні викладачі і зручне місце розташування! Я дуже рада що обрала саме Харківський патентно- комп’ютерний коледж серед всіх інших коледжів Харкова.',
                img: face4
            },
            {
                text: 'ХПКК мені подобається. Випустилась рік тому. Головне влитися в навчальний процес. Тоді все буде: знання, успішність, упевненість в майбутньому. Пари проходять цікаво, професійні викладачі, цікаво спілкуватися з такими людьми. Взагалі все в колледжі классно !!! Якість навчання на гідному рівні, ХПКК рекомендую. Взагалі, все залежить тільки від вас самих: ніхто за вас не буде вивчати матеріал, складати іспити. Всім удачі!',
                img: face3
            },
        ],
        footerPage: {
            contactsText: "Contacts",
            telephoneNumber: "+380 50 700 48 15",
            telephoneNumberCall: "+380 50 700 48 15",
            email: "help@compcollege.org",
            street: "Yaroslava Mudroho, 18",
            footerIcons: [{
                    src: "",
                    alt: "F"
                },
                {
                    src: "",
                    alt: "T"
                },
                {
                    src: "",
                    alt: "I"
                }
            ],
            footerHFKF: [
                ["#ХКФК", " - it is to learn by dreaming"],
                ["#ХКФК", " - it is a lot of interesting events"],
                ["#ХКФК", " - these are unforgettable student years"],
                ["#ХКФК", " - it is a success"]
            ]
        },
        achievements: {
            head: 'College achievements',
            textF: 'For many years in a row, our students have demonstrated success in interregional and national competitions. Kharkiv Patent Computer College is an educational institution whose main task is to provide training for a competitive specialist in the labor market. In the field of educational activities the result is achieved by high professional activity of teachers: course preparation, methodical activities (methodical associations, creative groups, trainings, seminars), study of best practices, conducting open classes, mutual attendance, educational and methodical activities, self-education, participation in subject commissions on general educational disciplines.',
            textS: 'In order to improve the professional training of teachers, methodical work is carried out, which encourages each teacher to improve their professional level. In the process of methodical work the scientific level of the pedagogical worker is raised, his preparation for mastering the content of new programs, constant acquaintance with the achievements of teaching methods, enrichment with progressive methods and teaching aids.',
            sub: 'Recent achievements',
            years: [{
                    year: 2019,
                    yearText: '2019 year',
                    go: 'Go'
                },
                {
                    year: 2018,
                    yearText: '2018 year',
                    go: 'Go'
                }, {
                    year: 2017,
                    yearText: '2017 year',
                    go: 'Go'
                }
            ]
        },
        structureModalPage: {
            headMain: {
                img: r36,
                fio: 'Прізвище Ім’я По-батькові',
                rank: 'голова циклової комісії з програмування',
                back: 'Back text'

            },
            default: [{
                    img: r36,
                    fio: 'Прізвище Ім’я По-батькові',
                    rank: 'голова циклової комісії з програмування',
                    back: 'Back text'
                }, {
                    img: r36,
                    fio: 'Прізвище Ім’я По-батькові',
                    rank: 'голова циклової комісії з програмування',
                    back: 'Back text'
                },
                {
                    img: r36,
                    fio: 'Прізвище Ім’я По-батькові',
                    rank: 'голова циклової комісії з програмування',
                    back: 'Back text'
                },
                {
                    img: r36,
                    fio: 'Прізвище Ім’я По-батькові',
                    rank: 'голова циклової комісії з програмування',
                    back: 'Back text'
                },
                {
                    img: r36,
                    fio: 'Прізвище Ім’я По-батькові',
                    rank: 'голова циклової комісії з програмування',
                    back: 'Back text'
                },
                {
                    img: r36,
                    fio: 'Прізвище Ім’я По-батькові',
                    rank: 'голова циклової комісії з програмування',
                    back: 'Back text'
                }
            ]
        },
        workPage: {
            head: 'Employment',
            textF: 'Work on employment of college graduates begins with enrollment of students of a new reception. Students who enroll in state-funded places enter into employment agreements after graduating from college.',
            textS: 'An employment commission has been set up to coordinate employment activities at the college.',
            textT: 'Regulations on the commission of the Kharkiv Patent and Computer College to promote the employment of students and graduates have been developed.',
            bPartners: 'Main partners',
            comision: "The Commission for the Promotion of Employment of Students and Alumni of the College carries out: establishing business relations with employment services, enterprises, institutions and organizations (employers) on training and employment of students and graduates; study of the dynamics of demand for relevant specialists in the labor market, providing appropriate proposals to the management of higher education; cooperation with other enterprises on employment of students and graduates; providing advice to students and graduates on the preparation of their own resume; organization of students' practice in search of enterprises, institutions and organizations (employers).",
            oPartnets: 'Our partners'
        },
        coursePage: {
            "121": {
                "1": {
                    "91": 91,
                    "92": 92,
                    "93": 93
                },
                "2": {
                    "91": 91,
                    "92": 92,
                    "93": 93
                },
                "3": {
                    "91": 91,
                    "92": 92,
                    "93": 93
                },
                "4": {
                    "91": 91,
                    "92": 92,
                    "93": 93
                }
            },
            "123": {
                "1": {
                    "91": 91,
                    "92": 92,
                    "93": 93
                },
                "2": {
                    "91": 91,
                    "92": 92,
                    "93": 93
                },
                "3": {
                    "91": 91,
                    "92": 92,
                    "93": 93
                },
                "4": {
                    "91": 91,
                    "92": 92,
                    "93": 93
                }
            }
        },
        unitPage: {
            "1": [{
                    date: '16.03.2020',
                    day: 'Понеділок',
                    schedule: {
                        "1": 'Математика',
                        "2": 'Українська мова'
                    }
                },
                {
                    date: '17.03.2020',
                    day: 'Вівторок',
                    schedule: {}
                },
                {
                    date: '18.03.2020',
                    day: 'Середа',
                    schedule: {
                        "1": 'Українська мова',
                        "2": 'Математика'
                    }
                },
                {
                    date: '19.03.2020',
                    day: 'Четвер',
                    schedule: {}
                },
                {
                    date: '20.03.2020',
                    day: 'П\'ятниця',
                    schedule: {}
                },
                {
                    date: '21.03.2020',
                    day: 'Субота',
                    schedule: {}
                }
            ],
            "2": [{
                    date: '16.03.2020',
                    day: 'Понеділок',
                    schedule: {
                        "1": 'Математика',
                        "2": 'Українська мова'
                    }
                },
                {
                    date: '17.03.2020',
                    day: 'Вівторок',
                    schedule: {}
                },
                {
                    date: '18.03.2020',
                    day: 'Середа',
                    schedule: {
                        "1": 'Українська мова',
                        "2": 'Математика'
                    }
                },
                {
                    date: '19.03.2020',
                    day: 'Четвер',
                    schedule: {}
                },
                {
                    date: '20.03.2020',
                    day: 'П\'ятниця',
                    schedule: {}
                },
                {
                    date: '21.03.2020',
                    day: 'Субота',
                    schedule: {}
                }
            ],
            "3": [{
                    date: '16.03.2020',
                    day: 'Понеділок',
                    schedule: {
                        "1": 'Математика',
                        "2": 'Українська мова'
                    }
                },
                {
                    date: '17.03.2020',
                    day: 'Вівторок',
                    schedule: {}
                },
                {
                    date: '18.03.2020',
                    day: 'Середа',
                    schedule: {
                        "1": 'Українська мова',
                        "2": 'Математика'
                    }
                },
                {
                    date: '19.03.2020',
                    day: 'Четвер',
                    schedule: {}
                },
                {
                    date: '20.03.2020',
                    day: 'П\'ятниця',
                    schedule: {}
                },
                {
                    date: '21.03.2020',
                    day: 'Субота',
                    schedule: {}
                }
            ],
            "13": [{
                    date: '16.03.2020',
                    day: 'Понеділок',
                    schedule: {
                        "1": 'Математика',
                        "2": 'Українська мова'
                    }
                },
                {
                    date: '17.03.2020',
                    day: 'Вівторок',
                    schedule: {}
                },
                {
                    date: '18.03.2020',
                    day: 'Середа',
                    schedule: {
                        "1": 'Українська мова',
                        "2": 'Математика'
                    }
                },
                {
                    date: '19.03.2020',
                    day: 'Четвер',
                    schedule: {}
                },
                {
                    date: '20.03.2020',
                    day: 'П\'ятниця',
                    schedule: {}
                },
                {
                    date: '21.03.2020',
                    day: 'Субота',
                    schedule: {}
                }
            ],
            "14": [{
                    date: '16.03.2020',
                    day: 'Понеділок',
                    schedule: {
                        "1": 'Математика',
                        "2": 'Українська мова'
                    }
                },
                {
                    date: '17.03.2020',
                    day: 'Вівторок',
                    schedule: {}
                },
                {
                    date: '18.03.2020',
                    day: 'Середа',
                    schedule: {
                        "1": 'Українська мова',
                        "2": 'Математика'
                    }
                },
                {
                    date: '19.03.2020',
                    day: 'Четвер',
                    schedule: {}
                },
                {
                    date: '20.03.2020',
                    day: 'П\'ятниця',
                    schedule: {}
                },
                {
                    date: '21.03.2020',
                    day: 'Субота',
                    schedule: {}
                }
            ],
            "15": [{
                    date: '16.03.2020',
                    day: 'Понеділок',
                    schedule: {
                        "1": 'Математика',
                        "2": 'Українська мова'
                    }
                },
                {
                    date: '17.03.2020',
                    day: 'Вівторок',
                    schedule: {}
                },
                {
                    date: '18.03.2020',
                    day: 'Середа',
                    schedule: {
                        "1": 'Українська мова',
                        "2": 'Математика'
                    }
                },
                {
                    date: '19.03.2020',
                    day: 'Четвер',
                    schedule: {}
                },
                {
                    date: '20.03.2020',
                    day: 'П\'ятниця',
                    schedule: {}
                },
                {
                    date: '21.03.2020',
                    day: 'Субота',
                    schedule: {}
                }
            ]
        },
        awardPage: {
            "2019": {
                img1: bitmap,
                img2: bitmap,
                text: 'Lorem, ipsum dolor sit amet consectetur adipisicing elit. Voluptates repellendus officia a aperiam reiciendis provident enim. Tenetur rerum reprehenderit deserunt dolorem earum vitae? Ipsum quaerat corrupti voluptates reiciendis corporis cupiditate molestias consectetur quod porro iste architecto, culpa, tempora laborum. In dolorem asperiores excepturi ipsam culpa minus iusto porro accusamus illum voluptates suscipit vitae inventore error facilis, dignissimos corrupti unde! Nesciunt ipsam sapiente aperiam laudantium? Magni corrupti nisi quia natus temporibus in exercitationem veritatis reprehenderit esse? Modi ad repudiandae molestias asperiores non odit incidunt! Error aut, odio officia dignissimos obcaecati, ipsa nam vitae atque qui maiores nostrum ipsam soluta rerum illum.',
                year: 2019
            },
            "2018": {
                img1: bitmap,
                img2: bitmap,
                text: 'Lorem, ipsum dolor sit amet consectetur adipisicing elit. Voluptates repellendus officia a aperiam reiciendis provident enim. Tenetur rerum reprehenderit deserunt dolorem earum vitae? Ipsum quaerat corrupti voluptates reiciendis corporis cupiditate molestias consectetur quod porro iste architecto, culpa, tempora laborum. In dolorem asperiores excepturi ipsam culpa minus iusto porro accusamus illum voluptates suscipit vitae inventore error facilis, dignissimos corrupti unde! Nesciunt ipsam sapiente aperiam laudantium? Magni corrupti nisi quia natus temporibus in exercitationem veritatis reprehenderit esse? Modi ad repudiandae molestias asperiores non odit incidunt! Error aut, odio officia dignissimos obcaecati, ipsa nam vitae atque qui maiores nostrum ipsam soluta rerum illum.',
                year: 2018
            },
            "2017": {
                img1: bitmap,
                img2: bitmap,
                text: 'Lorem, ipsum dolor sit amet consectetur adipisicing elit. Voluptates repellendus officia a aperiam reiciendis provident enim. Tenetur rerum reprehenderit deserunt dolorem earum vitae? Ipsum quaerat corrupti voluptates reiciendis corporis cupiditate molestias consectetur quod porro iste architecto, culpa, tempora laborum. In dolorem asperiores excepturi ipsam culpa minus iusto porro accusamus illum voluptates suscipit vitae inventore error facilis, dignissimos corrupti unde! Nesciunt ipsam sapiente aperiam laudantium? Magni corrupti nisi quia natus temporibus in exercitationem veritatis reprehenderit esse? Modi ad repudiandae molestias asperiores non odit incidunt! Error aut, odio officia dignissimos obcaecati, ipsa nam vitae atque qui maiores nostrum ipsam soluta rerum illum.',
                year: 2017
            },
            "2016": {
                img1: bitmap,
                img2: bitmap,
                text: 'Lorem, ipsum dolor sit amet consectetur adipisicing elit. Voluptates repellendus officia a aperiam reiciendis provident enim. Tenetur rerum reprehenderit deserunt dolorem earum vitae? Ipsum quaerat corrupti voluptates reiciendis corporis cupiditate molestias consectetur quod porro iste architecto, culpa, tempora laborum. In dolorem asperiores excepturi ipsam culpa minus iusto porro accusamus illum voluptates suscipit vitae inventore error facilis, dignissimos corrupti unde! Nesciunt ipsam sapiente aperiam laudantium? Magni corrupti nisi quia natus temporibus in exercitationem veritatis reprehenderit esse? Modi ad repudiandae molestias asperiores non odit incidunt! Error aut, odio officia dignissimos obcaecati, ipsa nam vitae atque qui maiores nostrum ipsam soluta rerum illum.',
                year: 2016
            },
            "2015": {
                img1: bitmap,
                img2: bitmap,
                text: 'Lorem, ipsum dolor sit amet consectetur adipisicing elit. Voluptates repellendus officia a aperiam reiciendis provident enim. Tenetur rerum reprehenderit deserunt dolorem earum vitae? Ipsum quaerat corrupti voluptates reiciendis corporis cupiditate molestias consectetur quod porro iste architecto, culpa, tempora laborum. In dolorem asperiores excepturi ipsam culpa minus iusto porro accusamus illum voluptates suscipit vitae inventore error facilis, dignissimos corrupti unde! Nesciunt ipsam sapiente aperiam laudantium? Magni corrupti nisi quia natus temporibus in exercitationem veritatis reprehenderit esse? Modi ad repudiandae molestias asperiores non odit incidunt! Error aut, odio officia dignissimos obcaecati, ipsa nam vitae atque qui maiores nostrum ipsam soluta rerum illum.',
                year: 2015
            }
        },
        zaminyPage: {
            "121": {
                "1": {
                    "1": "/replacementPage?course=1&group=1",
                    "2": "/replacementPage?course=1&group=2",
                    "3": "/replacementPage?course=1&group=3",
                },
                "2": {
                    "1": "/replacementPage?course=2&group=1",
                    "2": "/replacementPage?course=2&group=2",
                    "3": "/replacementPage?course=2&group=3",
                },
                "3": {
                    "1": "/replacementPage?course=3&group=1",
                    "2": "/replacementPage?course=3&group=2",
                    "3": "/replacementPage?course=3&group=3",
                },
                "4": {
                    "1": "/replacementPage?course=4&group=1",
                    "2": "/replacementPage?course=4&group=2",
                    "3": "/replacementPage?course=4&group=3",
                }
            },
            "123": {
                "1": {
                    "4": "/replacementPage?course=1&group=4",
                    "5": "/replacementPage?course=1&group=5",
                },
                "2": {
                    "4": "/replacementPage?course=2&group=4",
                    "5": "/replacementPage?course=2&group=5",
                },
                "3": {
                    "4": "/replacementPage?course=3&group=4",
                    "5": "/replacementPage?course=3&group=5",
                },
                "4": {
                    "4": "/replacementPage?course=4&group=4",
                    "5": "/replacementPage?course=4&group=5",
                }
            }
        },
        achievementsPage: {
            "2017": {
                head: "Participation in the International Programming Olympiad Vekua Cup",
                text: [
                    '<p class="sub-main-text">On October 28-29, 2017, college students took part in the International Programming Olympiad "Vecua Cup".</p>',
                    '<p class="sub-main-text">The Olympiad was held in 2 rounds: individual and team. Students of Higher Educational Institutions of Georgia, Ukraine, Belarus, Azerbaijan, and Russia took part in the Olympiad. Kharkiv students were provided with a basic platform for participation in the Olympiad by KNURE.</p>',
                    '<p class="sub-main-text">Patent and Computer College students took part in both rounds and showed excellent results.</p>',
                    '<p class="sub-main-text">In the individual round students Dmitry Dorodnykh (group P-41), Konstantin Kravchik (group P-41), Vyacheslav Kotsyuba (group P-52), Konstantinov Vladislav (group P-52), Marina Kudryavtseva .P-42) entered the hundred best.</p>',
                    '<p class="sub-main-text">4 teams from the college took part in the team tour: DeusVult (Kravchyk Konstantin, Dorodnykh Dmytro and Radchenko Vladyslava), GoldSun (Kotsyuba Vyacheslav, Konstantinov Vladislav and Musienko Oleksiy), HPPTeam (Mamedov Timur, Kudryavtseva Marina, Kiyakin) Hamidov Daler, Podoprigora Danilo).</p>',
                    '<p class="sub-main-text">Our teams DeusVult and GoldSun were ahead of the teams of NTU "KhPI" and KhNEU and were only two positions behind the team of KNURE "ZeroDay".</p>',
                    '<p class="sub-main-text">Congratulations to our participants!</p>'
                ]
            },
            "2018": {
                head: "KPCC: first place in the regional English-language brainstorming ring in computer science",
                text: [
                    "<p class=\"sub-main-text\">1 February 2018 year</p>",
                    "<p class=\"sub-main-text\">The team of Kharkiv Patent and Computer College \"Sunny Side\" took the first place in the regional English-language brain-ring in computer science. The event was held on the basis of KRTT, the game was attended by 10 teams from universities of I-II levels of accreditation.</p>",
                    "<p class=\"sub-main-text\">Fluency in English, professional knowledge, team cohesion, positive mood and self-confidence led to the victory of our team.</p>",
                    '<p class="sub-main-text">Team members</p>',
                    '<p class="sub-main-text">Knysh Oleksiy (P71) is the team captain  </p>',
                    '<p class="sub-main-text">Yevtushenko Sergey (P62)</p>',
                    '<p class="sub-main-text">Nazar\'s Rooster (P71)</p>',
                    '<p class="sub-main-text">Grigorov Egor (P71)</p>',
                    '<p class="sub-main-text">Kasumov Bogdan (P62)</p>',
                    '<p class="sub-main-text">Anakhin George (P62)</p>',
                    '<p class="sub-main-text">In the fourth round, the Sunny Side team won the right to compete in the final of the game.</p>',
                    `<img src=${ach1} alt="ach1" />`,
                    '<p class="sub-main-text">The final game. Tension and concentration.</p>',
                    `<img src=${ach2} alt="ach2" />`,
                    '<p class="sub-main-text">Rewarding the team. Diploma and sweet gifts.</p>',
                    `<img src=${ach3} alt="ach3" />`,
                    '<p class="sub-main-text">The final photo in memory of pleasant and joyful emotions. </p>',
                    `<img src=${ach4} alt="ach4" />`,
                ]
            },
            "2019": {
                head: "Taras Shevchenko Literary and Language Competition",
                text: [
                    '<p class="sub-main-text">The regional stage of the 10th Taras Shevchenko International Literary and Linguistic Competition was held on the basis of the Kharkiv Patent and Computer College.</p>'
                ]
            }
        }
    },
}

const languageReducer = (state = initialState, action) => {
    switch (action.type) {
        case 'SET_LANGUAGE': {
            return {
                ...state,
                from: action.payload
            }
        }
        default:
            return state
    }
}

export default languageReducer;