import React from 'react'
import './OpenDay.css'

export default () => (
	<div className="open-day">
		<div className="container">
			<div className="open-day-red-padd-block red-padd-block">
				<h2 className="open-day-head-text head-text">День відкритих дверей</h2>
			</div>
			<h2 className="open-day-sub-head-text sub-head-text">Запрошуємо</h2>
			<p className="open-day-sub-main-text sub-main-text">День відкритих дверей — це традиційний захід, у рамках якого вступники мають змогу отримати необхідну інформацію про навчання в коледжі  та зробити перший крок до своєї освіти в Харківському патентно- комп’ютерний коледжі.</p>
			<p className="open-day-sub-main-text sub-main-text">У ході Дня відкритих дверей абітурієнти мають можливість дізнатися про напрями, за якими здійснюється підготовка в коледжі, та Правила прийому від представників Приймальної комісії. Вступники також отримують інформацію про особливості зовнішнього незалежного оцінювання в поточному навчальному році. Також проводяться зустрічі абітурієнтів та їхніх батьків із адміністрацією та вчителями, під час яких відвідувачі одержують детальну інформацію щодо наявних напрямів, дізнаються про навчальний процес та практики, перспективи працевлаштування випускників, організацію дозвілля та побуту студентів.</p>
			<p className="open-day-sub-main-text sub-main-text">Шановні абітурієнти!Справжній успіх приносить лише та робота, яку обирають за власним бажанням, відповідно до інтересів та здібностей. Сподіваємось, що Ви отримаете вичерпну інформацію про коледж та можливості, які отримує кожен його студент після навчання.</p>
			<p className="open-day-sub-main-text sub-main-text">На даному етапі Вашого життя важливо, бути активними і креативними у виборі професії та майбутнього.</p>
			<p className="place main-text"><span className="medium">Місце проведення</span>: м.Харків, вул.Ярослава Мудрого 18</p>
			<p className="open-day-add-info main-text"><span className="medium">Додаткова інформація за телефонами:</span></p>
			<p className="open-day-main-text main-text">(050) 700-48-17</p>
			<p className="open-day-main-text main-text">(050) 700-48-15</p>	
		</div>
	</div>
)